Tekla.Structures.DirectManipulation.Model.ISurfacePreviewProvider
The Tekla.Structures.DirectManipulation.Model.ISurfacePreviewProvider provides the previews of the surface objects.

Tekla.Structures.DirectManipulation.Model.ISurfacePreviewProvider.GetSurfaceCreationPreview(System.Int32,Tekla.Common.Geometry.Vector3,Tekla.Common.Geometry.UnitVector3)
Gets the preview for the surface object.
id: The ID of the underlying model object.
pointOnFace: The point on the face of the underlying model object.
faceNormal: The normal of the face of the underlying model object.
Returns:
The list of Tekla.Structures.Geometry3d.FacetedBrep if the preview could be created; null otherwise